Интерлинк_УНФ.Интерлинк/src/DataProcessors/ПечатьСчетФактура/ПечатьСчетФактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПечатьСчетФактура</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Интерлинк_УНФ.Интерлинк/src/Documents/Интерлинк_УпаковочныйЛист/Интерлинк_УпаковочныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Интерлинк_УпаковочныйЛист</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаВручения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходнаяНакладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактура</name>
      <type>
        <types>DocumentRef.СчетФактура</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Паллета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интерлинк_УНФ.Интерлинк/src/DataProcessors/ПечатьСчетФактура/ManagerModule.bsl
&Перед("Печать")
Процедура Интерлинк_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Интерлинк_УпаковочныйЛистСписокДокументов.РасходнаяНакладная КАК РасходнаяНакладная
	|ИЗ
	|	Документ.Интерлинк_УпаковочныйЛист.СписокДокументов КАК Интерлинк_УпаковочныйЛистСписокДокументов
	|ГДЕ
	|	Интерлинк_УпаковочныйЛистСписокДокументов.Ссылка В(&МассивОбъектов)"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	МассивНакладных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РасходнаяНакладная");
	Если МассивНакладных.Количество() > 0 Тогда
		МассивОбъектов = МассивНакладных;
	КонецЕсли;

КонецПроцедуры
